0h7z.vscode-julia-format
bierner.markdown-checkbox
charliermarsh.ruff
davidanson.vscode-markdownlint
docker.docker
enkia.tokyo-night
foxundermoon.shell-format
github.codespaces
google.colab
iamhyc.overleaf-workshop
jock.svg
julialang.language-julia
leanprover.lean4
mathematic.vscode-pdf
mathworks.language-matlab
mechatroner.rainbow-csv
mermaidchart.vscode-mermaid-chart
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.live-server
ms-vscode.remote-explorer
myriad-dreamin.tinymist
openai.chatgpt
pdconsec.vscode-print
pkief.material-icon-theme
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
svelte.svelte-vscode
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
yzhang.markdown-all-in-one
